<template>
  <section class="container">
    <div class="columns">
      <div class="column">
        <h3>line Chart test</h3>
        <line-chart :data="data"></line-chart>
      </div>
    </div>
  </section>
</template>

<script>
  export default {
    name: 'TempChart',
    data () {
      return {
        data : [ {name: '검색어1',  data: {
      '1월': 3, 
      '2월': 4,
      '3월': 14,
      '4월': 24,
      '5월': 34,
      '6월': 44,
      '7월': 54,
      '8월': 36,
      '8월': 26,
      '9월': 16,
      '10월': 36,
      '11월': 246,
      '12월': 146
      }},

      {name: '검색어2',  data: {
      '1월': 31, 
      '2월': 41,
      '3월': 134,
      '4월': 241,
      '5월': 341,
      '6월': 441,
      '7월': 514,
      '8월': 316,
      '8월': 216,
      '9월': 116,
      '10월': 136,
      '11월': 246,
      '12월': 146
      }},

      {name: '검색어3',  data: {
      '1월': 311, 
      '2월': 14,
      '3월': 14,
      '4월': 214,
      '5월': 314,
      '6월': 414,
      '7월': 514,
      '8월': 316,
      '8월': 26,
      '9월': 16,
      '10월': 36,
      '11월': 246,
      '12월': 146
      }},

      {name: '검색어4',  data: {
      '1월': 32, 
      '2월': 34,
      '3월': 214,
      '4월': 324,
      '5월': 134,
      '6월': 244,
      '7월': 654,
      '8월': 326,
      '8월': 6,
      '9월': 16,
      '10월': 36,
      '11월': 546,
      '12월': 146
      }},

      {name: '검색어5',  data: {
      '1월': 3, 
      '2월': 4,
      '3월': 14,
      '4월': 254,
      '5월': 344,
      '6월': 414,
      '7월': 524,
      '8월': 336,
      '8월': 246,
      '9월': 156,
      '10월': 636,
      '11월': 746,
      '12월': 846
      }}
]
      }
    }
  }
</script>



